{
    "MQCode": "1A12",
    "learning_objective": "Develop plans that describe a program’s sequence of events, goals, and expected outcomes.",
    "interest_area": "Diversity and inclusion",
    "topic": "Ethnic and Racial Diversity",
    "coding": true,
    "question_str": "{\n    \"Question\": \"Zahra is developing a program that analyses data regarding the diversity in their community with regards to race and ethnicity. The solution should ideally help to highlight representation and differences in variable such as income level, education, professions, etc. Zahra plans to use the given code as part of their program:What should Zahra's plan with regards to the program sequence, goals and expected outcomes include based on the given code snippet?\",\n    \"Answer1\": \"Zahra might want to create a sequence where race and ethnicity data is first collected, followed by collection of variable data. The goal could be to generate a report highlighting adequate representation, and the expected outcome might be improved policies informed by the data analysis.\",\n    \"Answer2\": \"Zahra should create a program that initiates segregation and fosters divisions. The goal should be to create distinct categories and encourage separateness. The expected outcome is heightened divisions.\",\n    \"Answer3\": \"Zahra should plan to design a race and ethnicity collection tool. The goals could be to collect and archive the diversity data without any tangible outcome or expected results.\",\n    \"Answer4\": \"The program sequence can include collection of race and ethnicity data without any regard to other variables. The goals could be to simply archive the data and the expected outcome is to maintain status quo.\",\n    \"CorrectAnswer\": \"1\",\n    \"Explanation\": \"Zahra's program should work with the aim to collect, analyse, understand and use the knowledge to improve representation and inclusivity in the community. Therefore, creating a program sequence that collects relevant data, sets a goal to create a comprehensive understanding of representation in variables and expects an outcome that can influence improved policies, is the ideal approach.\",\n    \"code_snippet\": \"class Community\\n   text Race\\n   text Ethnicity\\n   number Income\\n   number Education_Level\\n   text Profession\\nend\"\n}"
}