{
    "1D07": "Identify and describe patterns in data visualizations, such as charts or graphs, to make predictions.",
    "1A08": "Model daily processes by creating and following algorithms (sets of step-by-step instructions) to complete tasks.",
    "1A09": "Model the way programs store and manipulate data by using numbers or other symbols to represent information.",
    "1A10": "Develop programs with sequences and simple loops, to express ideas or address a problem.",
    "1A11": "Decompose (break down) the steps needed to solve a problem into a precise sequence of instructions.",
    "1A12": "Develop plans that describe a program’s sequence of events, goals, and expected outcomes.",
    "1A14": "Debug (identify and fix) errors in an algorithm or program that includes sequences and simple loops.",
    "1A15": "Using correct terminology, describe steps taken and choices made during the iterative process of program development.",
    "2C02": "Model how computer hardware and software work together as a system to accomplish tasks.",
    "2C03": "Determine potential solutions to solve simple hardware and software problems using common troubleshooting strategies.",
    "2N04": "Model how information is broken down into smaller pieces, transmitted as packets through multiple devices over networks and the Internet, and reassembled at the destination.",
    "2D06": "Organize and present collected data visually to highlight relationships and support a claim.",
    "2D07": "Use data to highlight or propose cause-and-effect relationships, predict outcomes, or communicate an idea.",
    "2A08": "Compare and refine multiple algorithms for the same task and determine which is the most appropriate.",
    "2A09": "Create programs that use variables to store and modify data.",
    "2A10": "Create programs that include sequences, events, loops, and conditionals.",
    "2A11": "Decompose (break down) problems into smaller, manageable subproblems to facilitate the program development process.",
    "2A12": "Modify, remix, or incorporate portions of an existing program into one's own work, to develop something new or add more advanced features.",
    "2A13": "Use an iterative process to plan the development of a program by including others' perspectives and considering user preferences.",
    "2A14": "Observe intellectual property rights and give appropriate attribution when creating or remixing programs.",
    "2A15": "Test and debug (identify and fix errors) a program or algorithm to ensure it runs as intended.",
    "2A17": "Describe choices made during program development using code comments, presentations, and demonstrations.",
    "4C01": "Explain how abstractions hide the underlying implementation details of computing systems embedded in everyday objects.",
    "4C02": "Compare levels of abstraction and interactions between application software, system software, and hardware layers.",
    "4C03": "Develop guidelines that convey systematic troubleshooting strategies that others can use to identify and fix errors.",
    "4D09": "Translate between different bit representations of real-world phenomena, such as characters, numbers, and images.",
    "4D12": "Create computational models that represent the relationships among different elements of data collected from a phenomenon or process.",
    "4A13": "Create prototypes that use algorithms to solve computational problems by leveraging prior student knowledge and personal interests.",
    "4A14": "Use lists to simplify solutions, generalizing computational problems instead of repeatedly using simple variables.",
    "4A15": "Justify the selection of specific control structures when tradeoffs involve implementation, readability, and program performance, and explain the benefits and drawbacks of choices made.",
    "4A16": "Design and iteratively develop computational artifacts for practical intent, personal expression, or to address a societal issue by using events to initiate instructions.",
    "4A17": "Decompose problems into smaller components through systematic analysis, using constructs such as procedures, modules, and/or objects.",
    "4A18": "Create artifacts by using procedures within a program, combinations of data and procedures, or independent but interrelated programs.",
    "4A19": "Systematically design and develop programs for broad audiences by incorporating feedback from users.",
    "4A23": "Document design decisions using text, graphics, presentations, and/or demonstrations in the development of complex programs.",
    "4I26": "Demonstrate ways a given algorithm applies to problems across disciplines."
}