{
    "MQCode": "2C03",
    "learning_objective": "Determine potential solutions to solve simple hardware and software problems using common troubleshooting strategies.",
    "interest_area": "Social justice",
    "topic": "Ethnic and Racial Equity/Justice",
    "coding": true,
    "question_str": "{\n    \"Question\": \"Alex is working on a computer science project that aims to address issues of ethnic and racial equity/justice. They are currently working on a program that generates random quotes from influential activists. Alex has written the following code snippet:What addition should Alex make to their code snippet to ensure that the generated quotes are diverse and inclusive?\",\n    \"Answer1\": \"Add a list of activists from diverse ethnic and racial backgrounds to the code, and randomly select quotes from this list.\",\n    \"Answer2\": \"Add a line of code that prompts the user to input the ethnic and racial background they would like the quote to come from.\",\n    \"Answer3\": \"Add a line of code that generates a random number and uses it to determine the ethnic and racial background from which the quote will be selected.\",\n    \"Answer4\": \"Add a line of code that generates a random number, and based on this number, randomly selects a quote either from a list of activists from diverse ethnic and racial backgrounds or from a list of generic quotes.\",\n    \"CorrectAnswer\": \"1\",\n    \"Explanation\": \"By adding a list of activists from diverse ethnic and racial backgrounds to the code, and randomly selecting quotes from this list, the code ensures that the generated quotes are diverse and inclusive. This promotes the goal of addressing issues of ethnic and racial equity/justice in the project.\",\n    \"code_snippet\": \"// List of activists\\nList<Activist> activists = new List<Activist>();\\n\\n// Add activists to the list\\nactivists.add(new Activist(\\\"Malcom X\\\", \\\"Civil Rights Activist\\\"));\\nactivists.add(new Activist(\\\"Gloria Steinem\\\", \\\"Feminist Activist\\\"));\\nactivists.add(new Activist(\\\"Cesar Chavez\\\", \\\"Farm Workers' Rights Activist\\\"));\\n\\n// Generate random quote\\nActivist randomActivist = activists.get(randomInteger(0, activists.size() - 1));\\noutput(randomActivist.getName() + \\\": \\\" + randomActivist.getQuote());\"\n}"
}